using System;
using Bogus;
using XCare.DMS.Entity;

namespace XCare.DMS.Uploading.Data.Mock
{
    public class YdhlJcbgMock
    {
        public static YdhlJcbg Mock(long zyh)
        {
            return new Faker<YdhlJcbg>().StrictMode(false)
                .RuleFor(e => e.Id, Guid.NewGuid())
                .RuleFor(e => e.Brbh, zyh)
                .RuleFor(e => e.Sqdh, f => f.Random.Long(600000000, 700000000))
                .RuleFor(e => e.Jklb,
                    f => f.PickRandom("3003", "3005", "2001", "2005", "2002", "3001", "X001", "X003", "4001", "4003",
                        "1002", "1001", "X002", "3004", "3002").ToString())
                .RuleFor(e => e.Jcxm, f => f.PickRandom("电脑多导联心电图(心电图室检查)",
                    "颈部淋巴结(颈动脉旁 + 腋下淋巴结 + 腹股沟淋巴结",
                    "CT机增强(64层)",
                    "肺通气功能检查",
                    "CT机平扫(64层)",
                    "彩色多普勒超声常规检查(B超室)",
                    "心脏超声检查",
                    "双源CT机增强加收",
                    "肿瘤浅表转移排查（颈",
                    "双肾及肾血管彩色多普"))
                .RuleFor(e => e.YjYingxiangsj,
                    f =>
                        f.PickRandom(
                            "QRS波群电压增高RV5大于2.5mv，RⅠ大于1.5mV,RV5+SV1大于4.0mV。  S-T段；Ⅰ、aVL、V4、V5、V6 水平压低mm。  T波；Ⅰ双向、 aVL倒置、V4、V5、V6双向。   V1呈QS型，V2呈qrS型，V3呈qrS型。",
                            "QRS波群电压增高R波振幅V6大于RV5。  T波；Ⅰ低平 、aVL倒置、 V4、V5、V6低平。  V1呈QS型，V2呈QS型 。",
                            "颈部： 双颈部软组织及大血管周围未见明显局限性异常回声。 右侧锁骨后方，锁骨下静脉下方可见一异常回声，大小62mm×48mm，形态不规则，边界清楚，内部回声均匀；CDFI检查内部血流增多。  腋下： 于右侧腋中线胸腔三、四肋间肺与胸壁之间见一不规则低回声，大小约47mm×15mm",
                            "QRS波群电压增高RV5大于2.5mv，RV5+SV1大于4.0mV。",
                            "平扫显示胸廓对称，两肺透亮度增高伴肺大泡，右肺野内及胸膜见多发大小不等结节影，边界尚清，较大者位于右肺上叶尖段，病灶密度不均匀，增强后见中度强化，静脉期有退出；两肺胸膜下区呈蜂窝状，小叶间隔增厚，各级支气管通畅，无扩张与狭窄，右肺门增大，右肺门及纵膈见多?",
                            "双侧基底节区见小斑点低密度影，脑室系统对称性扩大，脑沟、脑回、脑池及脑裂增宽、加深。中线结构无移位。颅板骨质未见异常改变。右侧上颌窦、筛窦、蝶窦粘膜增厚。",
                            "肝： 大小正常，形态未见明显异常，边缘未见明显异常改变。肝脏实质回声增粗，分布欠均匀，未见明显异常血流显示。肝实质内管道结构显示欠清楚。  胆囊：胆囊大小、形态正常，胆囊壁回声未见异常，胆囊内未见明显异常回声。肝内胆管及肝外胆管上段未见扩张，肝外胆管下段显示",
                            "平扫显示胸廓对称，两肺透亮度增高伴肺大泡，右肺野内及胸膜见多发大小不等结节影，边界尚清，较大者位于右肺上叶尖段，直径约为35mm，密度不均匀；两肺胸膜下区呈蜂窝状，小叶间隔增厚，各级支气管通畅，无扩张与狭窄，右肺门增大，右肺门及纵膈见多发大小不等淋巴结影。心?",
                            "心脏：  各房室不大，室间隔及左室游离壁不厚，室间隔基底段增厚（13mm），左室前壁局部运动减低，余室壁运动尚可。  升主动脉及主动脉窦部增宽（38mm，40mm）。各瓣膜回声及活动未见异常。  彩色多普勒超声示：二尖瓣口血流速度A峰大于E峰。少中量二尖瓣反流，微量主动脉瓣?",
                            "CT平扫+增强肝脏形态大小正常，表面光滑，各叶比例正常，密度均匀，未见明显异常密度影。肝内外胆管未见明显扩张，胆囊增大，胆囊壁不厚。胆总管扩张，内径约1.0cm，胰腺形态结构未见异常，胰管显影；脾脏结构未见异常。胃充盈差，胃体粘膜增厚，增强后见明显均匀强化；左肾?"))
                .RuleFor(e => e.YjYingxiangzd, f => f.PickRandom("1、窦性心律  2、左心室高电压  3、前间壁异常Q波  4、ST段-T波异常",
                    "1、窦性心律  2、左心室高电压  3、T波改变  4、异常Q波",
                    "右侧锁骨后方占位 考虑LNM  右侧胸腔占位",
                    "1、窦性心律  2、左心室高电压",
                    "1.右肺及胸膜多发结节，伴右肺门及纵膈内多发肿大淋巴结，考虑右肺上叶尖段占位，肺内及胸膜转移瘤，请结合临床病史。   2.肺气肿伴肺大泡，两肺间质性炎症改变。   3.主动脉硬化。",
                    "1.双侧基底节区腔隙灶，轻度老年脑改变。建议MR检查。   2.右侧上颌窦、筛窦、蝶窦炎症。",
                    "左肾萎缩 左侧肾脏弥漫性病变  肝脏回声增粗，请结合临床",
                    "右肺及胸膜多发结节，伴右肺门及纵膈内多发肿大淋巴结，考虑右肺上叶尖段占位，肺内及胸膜转移瘤可能，建议增强检查；   肺气肿伴肺大泡，两肺间质性炎症改变；   主动脉硬化。",
                    "室间隔及左室前壁局部运动减低  室间隔基底段增厚  升主动脉及主动脉窦部增宽  少中量二尖瓣反流  左室收缩功能正常",
                    "1、胆囊增大，胆总管扩张，请结合临床。   2、左肾体积明显小，发育不良可能；左肾内稍高密度影，复杂性囊肿可能，建议进一步检查。   附：右侧少量胸腔积液。   "))
                .Generate();
        }
    }
}